vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA255_DFP.pdsc
    <condition id="allOf.component.sgi_pkc.examples_flow_protection, component.sgi_pkc.hashmodes, component.sgi_pkc.random_modes, device=MCXA255.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_hashmodes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_random_modes"/>
      <require condition="device.MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.examples_hmac.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.hmac, component.sgi_pkc.memory, component.sgi_pkc.session, device=MCXA255.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.hmac, component.sgi_pkc.memory, component.sgi_pkc.session, device=MCXA255.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_hmac"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_memory"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_session"/>
      <require condition="device.MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.examples_key.condition_id">
      <require condition="allOf.component.sgi_pkc.aes, component.sgi_pkc.cipher, component.sgi_pkc.cipher_modes, component.sgi_pkc.key, device=MCXA255.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.aes, component.sgi_pkc.cipher, component.sgi_pkc.cipher_modes, component.sgi_pkc.key, device=MCXA255.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_aes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_cipher"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_cipher_modes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_key"/>
      <require condition="device.MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.examples_mac_modes.condition_id">
      <require condition="allOf.component.sgi_pkc.key, component.sgi_pkc.mac, component.sgi_pkc.mac_modes, device=MCXA255.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.key, component.sgi_pkc.mac, component.sgi_pkc.mac_modes, device=MCXA255.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_key"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_mac"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_mac_modes"/>
      <require condition="device.MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.examples_memory.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.session, device=MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.examples_random.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.session, device=MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.examples_random_modes.condition_id">
      <require condition="allOf.component.sgi_pkc.example, component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.random_modes, component.sgi_pkc.session, device=MCXA255.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.example, component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.random_modes, component.sgi_pkc.session, device=MCXA255.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_ecc_example"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_memory"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_random_modes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_session"/>
      <require condition="device.MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.examples_rsa.condition_id">
      <require condition="allOf.component.sgi_pkc.rsa, device=MCXA255.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.rsa, device=MCXA255.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_rsa"/>
      <require condition="device.MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.ffdh.condition_id">
      <require condition="allOf.device=MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.flow_protection.condition_id">
      <require condition="allOf.device=MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.glikey.condition_id">
      <require condition="allOf.component.sgi_pkc.pre_processor, device=MCXA255.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.pre_processor, device=MCXA255.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require condition="device.MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.hash.condition_id">
      <require condition="allOf.component.sgi_pkc.session, device=MCXA255.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.session, device=MCXA255.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_session"/>
      <require condition="device.MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.hashmodes.condition_id">
      <require condition="allOf.component.sgi_pkc.buffer, component.sgi_pkc.hash, device=MCXA255.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.buffer, component.sgi_pkc.hash, device=MCXA255.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_buffer"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_hash"/>
      <require condition="device.MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.hmac.condition_id">
      <require condition="allOf.component.sgi_pkc.key, component.sgi_pkc.padding, component.sgi_pkc.toolchain, device=MCXA255.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.key, component.sgi_pkc.padding, component.sgi_pkc.toolchain, device=MCXA255.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_key"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_padding"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain"/>
      <require condition="device.MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.key.condition_id">
      <require condition="allOf.component.sgi_pkc.buffer, component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA255.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.buffer, component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA255.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_buffer"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_memory"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_secure_counter"/>
      <require condition="device.MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.mac.condition_id">
      <require condition="allOf.component.sgi_pkc.padding, component.sgi_pkc.toolchain, device=MCXA255.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.padding, component.sgi_pkc.toolchain, device=MCXA255.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_padding"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain"/>
      <require condition="device.MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.mac_modes.condition_id">
      <require condition="allOf.component.sgi_pkc.mac, device=MCXA255.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.mac, device=MCXA255.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_mac"/>
      <require condition="device.MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.math.condition_id">
      <require condition="allOf.component.sgi_pkc.buffer, component.sgi_pkc.flow_protection, component.sgi_pkc.pkc, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA255.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.buffer, component.sgi_pkc.flow_protection, component.sgi_pkc.pkc, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA255.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_buffer"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pkc"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_secure_counter"/>
      <require condition="device.MCXA255.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.memory.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.param_integrity, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, component.sgi_pkc.toolchain, device=MCXA255.internal_condition"/>
    </condition>
