vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA255_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXA255_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXA255_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA255.condition_id" category="linkerScript" name="devices/MCXA255/arm/MCXA255_flash.scf" projectpath="MCXA255/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA255.condition_id" category="linkerScript" name="devices/MCXA255/arm/MCXA255_ram.scf" projectpath="MCXA255/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA255.condition_id" category="linkerScript" name="devices/MCXA255/gcc/MCXA255_flash.ld" projectpath="MCXA255/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA255.condition_id" category="linkerScript" name="devices/MCXA255/gcc/MCXA255_ram.ld" projectpath="MCXA255/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA255.condition_id" category="linkerScript" name="devices/MCXA255/iar/MCXA255_flash.icf" projectpath="MCXA255/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA255.condition_id" category="linkerScript" name="devices/MCXA255/iar/MCXA255_ram.icf" projectpath="MCXA255/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXA255" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXA255</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA255/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA255/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA255/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA255/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA255/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA255/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA255/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA255/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXA255/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXA255_startup</description>
      <files>
        <file condition="allOf.toolchains=armgcc, iar, mdk.condition_id" category="sourceC" attr="config" name="devices/MCXA255/startup_MCXA255.c" version="1.0.0" projectpath="startup"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXA255_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MCXA255_system</description>
      <files>
        <file category="sourceC" name="devices/MCXA255/system_MCXA255.c" projectpath="device"/>
        <file category="header" name="devices/MCXA255/system_MCXA255.h" projectpath="device"/>
        <file category="include" name="devices/MCXA255/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aoi" Cversion="2.0.2" condition="driver.aoi.condition_id">
      <description>AOI Driver</description>
      <files>
        <file category="header" name="devices/MCXA255/drivers/fsl_aoi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA255/drivers/fsl_aoi.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA255/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_lpcac" Cversion="2.2.0" condition="driver.cache_lpcac_n4a_mcxn.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXA255/drivers/fsl_cache_lpcac.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA255/drivers/fsl_cache_lpcac.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA255/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common" Cversion="1.0.0" condition="driver.camera-common.condition_id">
      <description>Driver camera-common</description>
      <files>
        <file category="header" name="components/video/camera/fsl_camera.h" projectpath="video"/>
        <file category="include" name="components/video/camera/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ap1302" Cversion="1.0.1" condition="driver.camera-device-ap1302.condition_id">
      <description>Driver camera-device-ap1302</description>
      <files>
        <file category="header" name="components/video/camera/device/ap1302/fsl_ap1302.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ap1302/fsl_ap1302.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ap1302/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common" Cversion="1.0.0" condition="driver.camera-device-common.condition_id">
      <description>Driver camera-device-common</description>
      <files>
        <file category="header" name="components/video/camera/device/fsl_camera_device.h" projectpath="video"/>
        <file category="include" name="components/video/camera/device/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-max9286" Cversion="1.0.2" condition="driver.camera-device-max9286.condition_id">
      <description>Driver camera-device-max9286</description>
      <files>
        <file category="header" name="components/video/camera/device/max9286/fsl_max9286.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/max9286/fsl_max9286.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/max9286/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-mt9m114" Cversion="1.0.2" condition="driver.camera-device-mt9m114.condition_id">
      <description>Driver camera-device-mt9m114</description>
      <files>
        <file category="header" name="components/video/camera/device/mt9m114/fsl_mt9m114.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/mt9m114/fsl_mt9m114.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/mt9m114/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov5640" Cversion="1.0.1" condition="driver.camera-device-ov5640.condition_id">
      <description>Driver camera-device-ov5640</description>
      <files>
        <file category="header" name="components/video/camera/device/ov5640/fsl_ov5640.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov5640/fsl_ov5640.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov5640/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov7670" Cversion="1.0.2" condition="driver.camera-device-ov7670.condition_id">
      <description>Driver camera-device-ov7670</description>
      <files>
        <file category="header" name="components/video/camera/device/ov7670/fsl_ov7670.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov7670/fsl_ov7670.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov7670/"/>
      </files>
    </component>
