vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA255_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft6x06" Cversion="1.0.0" condition="driver.ft6x06.condition_id">
      <description>Driver ft6x06</description>
      <files>
        <file category="header" name="components/touch/ft6x06/fsl_ft6x06.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ft6x06/fsl_ft6x06.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ft6x06/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxas21002cq" Cversion="1.0.0" condition="driver.fxas21002cq.condition_id">
      <description>Driver fxas21002cq</description>
      <files>
        <file category="header" name="components/sensor/fxas21002cq/fsl_fxas.h" projectpath="gyroscope"/>
        <file category="sourceC" name="components/sensor/fxas21002cq/fsl_fxas.c" projectpath="gyroscope"/>
        <file category="include" name="components/sensor/fxas21002cq/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxls8974cf" Cversion="1.0.0" condition="driver.fxls8974cf.condition_id">
      <description>Driver fxls8974cf</description>
      <files>
        <file category="header" name="components/sensor/fxls8974cf/fsl_fxls.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/fxls8974cf/fsl_fxls.c" projectpath="accel"/>
        <file category="include" name="components/sensor/fxls8974cf/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxos8700cq" Cversion="1.0.0" condition="driver.fxos8700cq.condition_id">
      <description>Driver fxos8700cq</description>
      <files>
        <file category="header" name="components/sensor/fxos8700cq/fsl_fxos.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/fxos8700cq/fsl_fxos.c" projectpath="accel"/>
        <file category="include" name="components/sensor/fxos8700cq/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="glikey" Cversion="2.0.1" condition="driver.glikey.condition_id">
      <description>GLIKEY Driver</description>
      <files>
        <file category="header" name="devices/MCXA255/drivers/fsl_glikey.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA255/drivers/fsl_glikey.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA255/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio" Cversion="2.8.2" condition="driver.gpio.condition_id">
      <description>GPIO Driver</description>
      <files>
        <file category="header" name="devices/MCXA255/drivers/fsl_gpio.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA255/drivers/fsl_gpio.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA255/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gt911" Cversion="1.0.4" condition="driver.gt911.condition_id">
      <description>Driver gt911</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/touch/gt911/fsl_gt911.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/gt911/fsl_gt911.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/gt911/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="htu21d" Cversion="1.0.0" condition="driver.htu21d.condition_id">
      <description>Driver htu21d</description>
      <files>
        <file category="header" name="components/sensor/htu21d/fsl_htu21d.h" projectpath="htu"/>
        <file category="sourceC" name="components/sensor/htu21d/fsl_htu21d.c" projectpath="htu"/>
        <file category="include" name="components/sensor/htu21d/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i3c" Cversion="2.14.2" condition="driver.i3c.condition_id">
      <description>I3C Driver</description>
      <files>
        <file category="header" name="devices/MCXA255/drivers/fsl_i3c.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA255/drivers/fsl_i3c.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA255/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i3c_edma" Cversion="2.2.10" condition="driver.i3c_edma.condition_id">
      <description>I3C EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXA255/drivers/fsl_i3c_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA255/drivers/fsl_i3c_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA255/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="icm42688p" Cversion="1.0.0" condition="driver.icm42688p.condition_id">
      <description>Driver icm42688p</description>
      <files>
        <file category="header" name="components/sensor/icm42688p/fsl_icm42688p.h" projectpath="icm42688p"/>
        <file category="sourceC" name="components/sensor/icm42688p/fsl_icm42688p.c" projectpath="icm42688p"/>
        <file category="include" name="components/sensor/icm42688p/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ili9341" Cversion="1.0.2" condition="driver.ili9341.condition_id">
      <description>Driver ili9341</description>
      <files>
        <file category="header" name="components/display/ili9341/fsl_ili9341.h" projectpath="lcdc"/>
        <file category="sourceC" name="components/display/ili9341/fsl_ili9341.c" projectpath="lcdc"/>
        <file category="include" name="components/display/ili9341/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux" Cversion="2.0.9" condition="driver.inputmux.condition_id">
      <description>INPUTMUX Driver</description>
      <files>
        <file category="header" name="devices/MCXA255/drivers/fsl_inputmux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA255/drivers/fsl_inputmux.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA255/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections" Cversion="2.0.0" condition="driver.inputmux_connections.condition_id">
      <description>Inputmux_connections Driver</description>
      <files>
        <file category="header" name="devices/MCXA255/drivers/fsl_inputmux_connections.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA255/drivers/"/>
      </files>
    </component>
